---
title: BuiltInExternalResourceTypes
classe: Autodesk.Revit.DB.ExternalResourceTypes+BuiltInExternalResourceTypes
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 16
---

# BuiltInExternalResourceTypes

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `ExternalResourceType AssemblyCodeTable { get; }` | `BuiltInExternalResourceTypes.AssemblyCodeTable` | ExternalResourceType |
| `ExternalResourceType CADLink { get; }` | `BuiltInExternalResourceTypes.CADLink` | ExternalResourceType |
| `ExternalResourceType DecalBumpMap { get; }` | `BuiltInExternalResourceTypes.DecalBumpMap` | ExternalResourceType |
| `ExternalResourceType DecalCutOut { get; }` | `BuiltInExternalResourceTypes.DecalCutOut` | ExternalResourceType |
| `ExternalResourceType DecalImage { get; }` | `BuiltInExternalResourceTypes.DecalImage` | ExternalResourceType |
| `ExternalResourceType DecalMap { get; }` | `BuiltInExternalResourceTypes.DecalMap` | ExternalResourceType |
| `ExternalResourceType DWFMarkup { get; }` | `BuiltInExternalResourceTypes.DWFMarkup` | ExternalResourceType |
| `ExternalResourceType FabricationConfiguration { get; }` | `BuiltInExternalResourceTypes.FabricationConfiguration` | ExternalResourceType |
| `ExternalResourceType IFCLink { get; }` | `BuiltInExternalResourceTypes.IFCLink` | ExternalResourceType |
| `ExternalResourceType Image { get; }` | `BuiltInExternalResourceTypes.Image` | ExternalResourceType |
| `ExternalResourceType KeynoteTable { get; }` | `BuiltInExternalResourceTypes.KeynoteTable` | ExternalResourceType |
| `ExternalResourceType MaterialTexture { get; }` | `BuiltInExternalResourceTypes.MaterialTexture` | ExternalResourceType |
| `ExternalResourceType PointCloud { get; }` | `BuiltInExternalResourceTypes.PointCloud` | ExternalResourceType |
| `ExternalResourceType RevitLink { get; }` | `BuiltInExternalResourceTypes.RevitLink` | ExternalResourceType |
| `ExternalResourceType SystemsAnalysisReport { get; }` | `BuiltInExternalResourceTypes.SystemsAnalysisReport` | ExternalResourceType |
| `ExternalResourceType TopographyLink { get; }` | `BuiltInExternalResourceTypes.TopographyLink` | ExternalResourceType |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```